[
    {
        "serviceId": 101,
        "serviceName": "Heated Bed & Shelter Installation",
        "providerName": "WarmHome Pet Solutions",
        "providerEmail": "support@warmhome.com",
        "price": 75.00,
        "rating": 4.7,
        "slotsAvailable": 8,
        "description": "Ensure your beloved companion is fully protected from freezing temperatures with our professional setup service. This comprehensive installation covers both heavy-duty outdoor heated shelters, ideal for community cats or working dogs, and specialized orthopedic indoor pet beds with safe heating elements for home use. Our certified technicians will conduct a site assessment to determine the optimal, draught-free placement, ensuring safe, weather-resistant wiring and power access according to all local safety codes. We install high-quality, thermostatically-controlled heating mats and pads that maintain a consistent, comfortable temperature without overheating. This service is essential for pets that spend extended time outdoors or senior and arthritic pets who require consistent deep warmth for maximum joint comfort and mobility throughout the harsh winter months, transforming any sleeping area into a perpetually cozy and safe haven.",
        "image": "https://i.postimg.cc/pdSSdrBX/Gemini-Generated-Image-nf959gnf959gnf95.png",
        "category": "Home Setup"
    },
    {
        "serviceId": 102,
        "serviceName": "Winter Coat & Boot Fitting",
        "providerName": "Tailored Paws Apparel",
        "providerEmail": "sales@tailoredpaws.com",
        "price": 25.00,
        "rating": 4.9,
        "slotsAvailable": 4,
        "description": "Give your pet the ultimate perfect fit for superior winter protection and comfort. This custom, one-on-one fitting session is led by our experienced apparel specialists, who carefully measure your pet to select the ideal insulated, water-resistant coat. We ensure the coat accommodates their specific breed and body shape, providing maximum warmth coverage without restricting natural movement or essential bathroom breaks. Crucially, a major focus is on fitting protective paw boots. We offer a variety of non-slip, durable, and waterproof options, meticulously checking for proper cuff tightness and pad coverage to prevent painful frostbite, cracked pads, and severe chemical burns from road salt and sidewalk de-icing agents, guaranteeing comfort and safety during every single winter walk.",
        "image": "https://i.postimg.cc/2y7TnSnk/Gemini-Generated-Image-nf959gnf959gnf95-1.png",
        "category": "Clothing & Safety"
    },
    {
        "serviceId": 103,
        "serviceName": "Moisturizing Paw Wax Application",
        "providerName": "Pawsitivity Groomers",
        "providerEmail": "book@pawsitivity.com",
        "price": 15.00,
        "rating": 4.8,
        "slotsAvailable": 12,
        "description": "Protect your pet's sensitive paw pads with our signature deep moisturizing wax treatment, which is significantly more effective than simple balms. The professional application involves gently cleaning the paw area, trimming excess hair between the pads, and meticulously massaging in a generous layer of our high-grade, veterinarian-approved paw wax. This treatment creates an invisible, yet durable and breathable, semi-permeable barrier that effectively shields the delicate pads from the abrasive elements of winter. It specifically guards against sharp ice crystals, corrosive de-icing chemicals, scorching hot pavement (even in winter), and extreme dryness caused by indoor heating. The natural formulation deeply nourishes and conditions the skin, preventing painful cracking, chapping, and bleeding, ensuring your pet's paws stay supple, healthy, and completely protected for weeks.",
        "image": "https://i.postimg.cc/L5pNq1gM/Gemini-Generated-Image-nf959gnf959gnf95-2.png",
        "category": "Grooming & Hygiene"
    },
    {
        "serviceId": 104,
        "serviceName": "Senior Pet Joint Health Massage",
        "providerName": "Comfort & Care Vet Clinic",
        "providerEmail": "vetcare@comfortclinic.com",
        "price": 60.00,
        "rating": 4.6,
        "slotsAvailable": 5,
        "description": "Provide relief and comfort to your senior or arthritic companion with our specialized joint health session. Cold weather is notorious for exacerbating conditions like arthritis and hip dysplasia, leading to stiffness and pain. Our certified veterinary technicians and therapists administer a therapeutic, low-impact massage that focuses on major joints, connective tissues, and muscle groups to improve circulation, reduce inflammation, and increase mobility. Following the hands-on treatment, you will receive a comprehensive supplement consultation with a vet, including recommendations for optimal dosage of Omega-3 fatty acids, glucosamine, and chondroitin, along with home care tips to help ease painful flare-ups and ensure your older pet stays comfortable and active throughout the cold season.",
        "image": "https://i.postimg.cc/cCSXKntS/Gemini-Generated-Image-nf959gnf959gnf95-3.png",
        "category": "Health & Wellness"
    },
    {
        "serviceId": 105,
        "serviceName": "Indoor Enrichment & Exercise Plan",
        "providerName": "ActivePaws Trainers",
        "providerEmail": "train@activepaws.com",
        "price": 40.00,
        "rating": 4.9,
        "slotsAvailable": 6,
        "description": "When outdoor playtime is limited by snow and extreme cold, pets can quickly become bored, destructive, and even anxious. Our professional trainers will develop a customized, engaging activity plan designed specifically for indoor environments. This plan includes teaching you how to utilize a variety of puzzle toys, treat-dispensing games, scent work activities, and constructive indoor agility exercises using household items. We focus on advanced mental stimulation techniques to exhaust energy safely and keep your pet's mind sharp and focused. This session includes a one-hour virtual consultation and a detailed PDF guide, ensuring you have a diverse, fun repertoire of indoor games to keep your companion mentally and physically stimulated and happy until spring arrives.",
        "image": "https://i.postimg.cc/mks8cH1B/Gemini-Generated-Image-nf959gnf959gnf95-4.png",
        "category": "Behavior & Training"
    },
    {
        "serviceId": 106,
        "serviceName": "Winter Nutrition & Diet Review",
        "providerName": "PetLife Dietitians",
        "providerEmail": "diet@petlife.com",
        "price": 35.00,
        "rating": 4.5,
        "slotsAvailable": 7,
        "description": "The change in season requires a change in caloric and nutritional requirements for most pets. Our certified pet dietitians will conduct a thorough review of your pet's current diet, taking into account their breed, age, activity level during winter, and body condition score. We provide a tailored consultation on adjusting your pet's caloric intake—whether they need slightly more energy to maintain body heat outdoors or fewer calories due to decreased exercise indoors—to prevent unwanted winter weight gain. The review also focuses heavily on hydration strategies, recommending specific supplements or meal additions to combat the common dryness associated with indoor heating. Ensure your pet's metabolism and immune system are optimally supported for excellent health throughout the colder months.",
        "image": "https://i.postimg.cc/xdWP74Q1/Gemini-Generated-Image-qzmr8qzmr8qzmr8q.png",
        "category": "Nutrition"
    },
    {
        "serviceId": 107,
        "serviceName": "Warm Water Bath & Blow-Dry",
        "providerName": "SnowSoft Grooming Studio",
        "providerEmail": "care@snowsoftgrooming.com",
        "price": 45.00,
        "rating": 4.8,
        "slotsAvailable": 10,
        "description": "Give your pet the ultimate pampering session to remove winter residue and ensure optimal coat health. This service begins with a gentle, warm-water bath using pH-balanced, deeply conditioning shampoos designed to soothe winter-dry skin and remove any salt, dirt, or road grime picked up on walks. The true value lies in the meticulous drying process: a soft, low-heat, high-velocity blow-dry is used to ensure the undercoat is completely dry, which is critical for maintaining your pet's insulation and preventing chills and uncomfortable dampness. We finish with a light conditioning spray to reduce static electricity (common in winter) and leave the coat smooth, clean, and perfectly protected against the cold, reducing the risk of matting and skin irritation.",
        "image": "https://plus.unsplash.com/premium_photo-1683133813802-7f3f128e87d1?q=80&w=1169&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "category": "Grooming & Hygiene"
    },
    {
        "serviceId": 108,
        "serviceName": "Home Heating Safety Check",
        "providerName": "CozyNest Pet Safety Team",
        "providerEmail": "support@cozynestpets.com",
        "price": 55.00,
        "rating": 4.7,
        "slotsAvailable": 6,
        "description": "Ensure your home remains a haven of warmth and safety during the cold season with our professional inspection service. This comprehensive safety check focuses entirely on identifying and mitigating risks associated with winter heating sources for pets. Our team will meticulously inspect all accessible heaters, space heaters, electrical cords, fireplaces, and vents for potential hazards, such as exposed wiring, burn risks from direct contact, and the placement of flammable pet bedding too close to heat sources. We provide expert advice and solutions for secure cord management and recommend safety gates or barriers to prevent curious pets from accessing dangerous areas, ensuring the entire heating system operates efficiently and safely around all members of your household.",
        "image": "https://plus.unsplash.com/premium_photo-1663926403570-94938c837508?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "category": "Home Setup"
    }
]